app/controllers/blacklists_controller.rb

SELECT * FROM `blacklists`
---
  def index
    @blacklists = Blacklist.find :all

SELECT * FROM `blacklists` WHERE (`blacklists`.`id` = 1)
---
  def show
    @has_sidebar = true
    @load_flot = true

    @blacklist = Blacklist.find params[:id]

INSERT INTO `blacklists` (`created_at`, `title`, `updated_at`) VALUES('2010-05-23 23:14:50', 'Webcache', '2010-05-23 23:14:50')
---
  def create
    new_blacklist = Blacklist.new params[:blacklist]
    if new_blacklist.save

DELETE FROM `blacklisted_terms` WHERE (blacklist_id = '10')
DELETE FROM `blacklists` WHERE `id` = 10
SELECT * FROM `blacklists` WHERE (`blacklists`.`id` = 10)
---
  def destroy
    begin
      BlacklistedTerm.delete_all [ "blacklist_id = ?", params[:id] ]
      blacklist = Blacklist.find params[:id]