app/controllers/blacklistedterms_controller.rb

INSERT INTO `blacklisted_terms` (`created_at`, `term`, `updated_at`, `blacklist_id`) VALUES('2010-05-23 23:25:41', 'test', '2010-05-23 23:25:41', 1)
---
  def create
    term = @blacklist.blacklisted_terms.create params[:blacklisted_term]

SELECT * FROM `blacklisted_terms` WHERE (`blacklisted_terms`.`id` = 4)
DELETE FROM `blacklisted_terms` WHERE `id` = 4
---
  def destroy
    term = @blacklist.blacklisted_terms.find(:conditions => {:_id => BSON::ObjectId(params[:id])})
    if term.destroy