app/controllers/messages_controller.rb

  def index
    @messages = Message.all_with_blacklist
    @total_count =  Message.count
    @total_blacklisted_terms = BlacklistedTerm.count
---
SELECT count(*) AS count_all FROM `blacklisted_terms`