app/controllers/streams_controller.rb

  def create
    new_stream = Stream.new params[:stream]
    if new_stream.save
---
INSERT INTO `streams` (`filter_level`, `created_at`, `title`, `filter_message`, `updated_at`, `filter_host`, `filter_severity`) VALUES(NULL, '2010-05-24 02:19:50', 'Test', NULL, '2010-05-24 02:19:50', NULL, NULL)